# seal
A small [REPL](https://en.wikipedia.org/wiki/Read%E2%80%93eval%E2%80%93print_loop)
with a simple syntax to experiment with Rust.

# Examples
Basic operations
```
> 1 + 2
3
> 1 - 2
-1
> 1 / 2
0
> 0 + (1 * 2)
2
```

Declaring and using variables
```
> x = 1
1
> y = 3*(x + 2)
9
```
